Revit 2026 API

# HardwoodHardwoodImperfectionsAmount Property

---

The property labeled "Amount" from the "Hardwood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string HardwoodImperfectionsAmount { get; }
```
```vb
Public Shared ReadOnly Property HardwoodImperfectionsAmount As String
	Get
```
```cpp
public:
static property String^ HardwoodImperfectionsAmount {
	String^ get ();
}
```
```fsharp
static member HardwoodImperfectionsAmount : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "-10, 10".

#### Reference

Hardwood Class

Autodesk.Revit.DB.Visual Namespace